[
    {
        "dish_name": "Spicy Crispy Potatoes",
        "dish_image": [
            "https://www.chinasichuanfood.com/wp-content/uploads/2017/11/Spicy-potatoes_-2.jpg"
        ],
        "prep_time": "no details",
        "cooking_time": "PT10M",
        "total_time": "PT25M",
        "ratings": "5 out of 5",
        "calories": "442 kcal",
        "ingredients": [
            "500 g small potatoes or large potatoes",
            "2 tbsp. cooking oil",
            "2  scallions ( ,white part and green part separated)",
            "2 tbsp. chopped garlic",
            "1 tbsp. chopped ginger",
            "1/4  red onion",
            "pinch of salt",
            "1  small bunch of coriander",
            "1 tbsp. Chinese chili oil ( ,optional)",
            "2 tbsp. red chili pepper powder",
            "1 tbsp. freshly ground cumin powder"
        ],
        "cooking_methods": [
            "Peel and cut large potatoes into one bite size pieces or if you use small baby potatoes, cook them directly. Simmer for around 12 to 15 minutes until the potatoes are just cooked so you can easily insert a chopstick without breaking the potatoes. Optional: remove the skins of the small potatoes",
            "Heat around 1 and 1/2 tablespoon of cooking oil in pan, add potatoes to fry until crispy and golden.",
            "Transfer the potatoes to the edges of the pan and add another 1/2 tablespoon of cooking oil in center and fry garlic, ginger and scallion until aromatic. Add red onion and continue frying for 2-3 minutes until the red onion becomes soft too.",
            "Sprinkle chili oil, salt, cumin power and red pepper powder if you are using. At last, mix coriander stem and chopped green onions.",
            "For those who love hotter version, simple serve with dried chili powders. You can simple serve with a mixed chili powder."
        ],
        "recommendation": [
            "https://www.chinasichuanfood.com/hong-shao-rou-red-braised-pork-belly/",
            "https://www.chinasichuanfood.com/chinese-mango-pudding/",
            "https://www.chinasichuanfood.com/coconut-milk-pudding/"
        ]
    },
    {
        "dish_name": "Hong Shao Rou—SuShi (Red Braised Pork Belly)",
        "dish_image": [
            "https://www.chinasichuanfood.com/wp-content/uploads/2014/09/hongshaorouSushi.jpg",
            "https://www.chinasichuanfood.com/wp-content/uploads/2014/09/hongshaorouSushi-500x500.jpg",
            "https://www.chinasichuanfood.com/wp-content/uploads/2014/09/hongshaorouSushi-500x375.jpg",
            "https://www.chinasichuanfood.com/wp-content/uploads/2014/09/hongshaorouSushi-480x270.jpg"
        ],
        "prep_time": "no details",
        "cooking_time": "PT60M",
        "total_time": "PT70M",
        "ratings": "5 out of 5",
        "calories": "691 kcal",
        "ingredients": [
            "500 g pork belly ( , cut into cubes around 2 inches)",
            "1 tbsp. cooking wine",
            "4 tbsp. light soy sauce",
            "2 tbsp. brown sugar ( , broken if you have large pieces)",
            "2 inches ginger ( , cut into slices)",
            "4  green onions ( , 1 finely chopped for garnish and the left into long sections)",
            "hot water to cover the pork cubes ( , as needed)",
            "oil for brushing ( , optional if you are using iron wok)"
        ],
        "cooking_methods": [
            "Clean and cut the pork belly into cubes around 2 inches long.",
            "Boil a large pot of water, add cooking wine, 2 slices of ginger and 2 green onions, cook the pork belly for around 4 minutes. Transfer out and wash with warm water. Set aside and drain.",
            "Add green onion and ginger slices in a clay pot and pre-heat it on a stove.",
            "Then on another stove, heat up wok on medium fire; brush some oil on the bottom. Sautee the pork belly until the surface becomes slightly brown. Transfer the pork cubes to our pre-heat clay pot.",
            "Put the brown sugar in wok to stir fry until all the sugar melts and you can see large bubbles. Keep stirring during the process. Pour hot water to cover the pork cubes. Mix well!",
            "Transfer the sugar mixture to the clay pot with pork belly or return the pork belly into your wok. Add light soy sauce too.",
            "Bring all the content to a boiling and then lower the fire to simmer for around 45 minutes with the lid covered.",
            "Lift the lid and turn up the fire to thicken the sauce (around 15 minutes). Stop when you see the sauce is boiling strongly with large bubbles and almost thickened. Cool down a little bit and the sauce will fatherly thicken itself.",
            "Garnish some chopped green onion before serving."
        ],
        "recommendation": [
            "https://www.chinasichuanfood.com/roasted-pork-belly-with-honey/",
            "https://www.chinasichuanfood.com/five-spice-powder/",
            "https://www.chinasichuanfood.com/zha-jiang-mian-minced-pork-noodles/"
        ]
    },
    {
        "dish_name": "Chinese Mango Pudding",
        "dish_image": [
            "https://www.chinasichuanfood.com/wp-content/uploads/2015/05/mango-pudding-8th-300x300-1.jpg",
            "https://www.chinasichuanfood.com/wp-content/uploads/2015/05/mango-pudding-8th-300x300-1-300x270.jpg"
        ],
        "prep_time": "no details",
        "cooking_time": "PT5M",
        "total_time": "PT20M",
        "ratings": "5 out of 5",
        "calories": "249 kcal",
        "ingredients": [
            "3  middle size mature mangoes ( , fresh mango cubes 1 pound)",
            "2 packet unflavored gelatin sheets ( , or 10g , see note 1 if you want to use gelatin powder)",
            "160 ml milk ( , or coconut milk)",
            "60 ml heavy cream ( , chilled)",
            "1/2 cup granulated sugar ( , or more if needed)"
        ],
        "cooking_methods": [
            "Soak gelatin sheets in cold water until soft.",
            "In a small pot, heat half of the milk, sugar and soaked gelatin over slow fire. Keep stirring and heat until sugar and gelatin dissolve completely. Remove from heat and set aside to cool down.",
            "Cut fresh mango in half and then dice the fresh mangos out. Place most of the mango cubes in blender and then add the left half milk or coconut milk; blend until very smooth.",
            "Mix mango smooth with milk prepared in step 1, add heavy cream too. Stir until evenly combined. And strain the mixture. You may need to use a spatula to help the mixture go through the strainer. Pour the mixture to your container or ramekins. Move to refrigerator for around 2 to 3 hours until completely set.",
            "Before eating, decorate with left mango cubes and mint leaves. Enjoy!"
        ],
        "recommendation": [
            "https://www.chinasichuanfood.com/dan-dan-noodles/",
            "https://www.chinasichuanfood.com/pork-and-mushroom-stir-fry/",
            "https://www.chinasichuanfood.com/youtiao-chinese-oil-stick-chinese-cruller/"
        ]
    }
]